Revit 2024 API
AnalyticalMember.SetMemberForces Method (MemberForces)
 Sets Member Forces to Analytical Member.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public void SetMemberForces(
	MemberForces memberForces
)
Visual Basic
Public Sub SetMemberForces ( _
	memberForces As MemberForces _
)
Visual C++
public:
void SetMemberForces(
	MemberForces^ memberForces
)
Parameters
memberForces
Type: Autodesk.Revit.DB.Structure.MemberForces
 End to which member forces will be added is defined by setting [!:Autodesk::Revit::DB::Structure::MemberForces::Position] property in provided Member Forces object.
Remarks
 If element already have member forces defined for that end, newly provided values replace current one. Member forces are strictly related with releases. This means that setting member forces values is reasonable only for directions that have releases set to false.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AnalyticalMember Class
SetMemberForces Overload
Autodesk.Revit.DB.Structure Namespace